_articles/2013-04-08-Learning-Python.org
#+TITLE:Learning Python
#+AUTHOR:ICECREAM(氷菓)
#+EMAIL:creamidea(AT)gmail.com
#+OPTIONS:H:4 num:t toc:t \n:nil @:t ::t |:t ^:t f:t TeX:t email:t
#+LINK_HOME: https://creamidea.github.io
#+STYLE:<link href="../css/style.css" rel="stylesheet" type="text/css">
#+STYLE:<link href='../font/Libre_Baskerville' rel='stylesheet' type='text/css'>
#+STYLE:<link href='../font/Great_Vibes' rel='stylesheet' type='text/css'>
#+STYLE:<link href='../font/Montserrat' rel='stylesheet' type='text/css'>
#+INFOJS_OPT:

#+BEGIN_HTML
---
layout: doc
title: Learning Python
subtitle: 学习Python的小型笔记 
categories: note
tags: python
---
#+END_HTML

* 前言
这个仅仅是一个开始。是的，这个仅仅是一个开始。

为何学习python？因为
#+BEGIN_QUOTE
life is short - you need Python!
#+END_QUOTE
*From* http://love-python.blogspot.com/

还有就是下面一个项目需要使用python[fn:1]和tornado[fn:2]来开发项目，一个上位机吧。
我们小组主要负责数据展示这个部分。硬件部分，也就是实际数据采集那个部分由企业来负责。

等待学习记录中...

file://D:/Org/org-mode-unicorn-logo.ico

* 2013-04-13 土曜日<2013-04-13 Sat>
  1. Tips:
     *How to run Python in Emacs org-mode? Below is the answer*
     Just input below into .emacs:
     #+BEGIN_SRC emacs-lisp
     (org-babel-do-load-languages
       'org-babel-load-languages '((python . t) (R . t)))
     #+END_SRC
     From:
     [[http://www.johndcook.com/blog/2012/02/09/python-org-mode/][Running Python and R inside Emacs]]
  
  2. python的一个切片操作：将字符串倒序输出
     #+BEGIN_SRC python :results output
       s = 'abcdefgh'
       a = s[::-1]
       print a  #a : hgfedcba
     #+END_SRC

     #+RESULTS:
     : hgfedcba

  3. 每次把最后的一个字符砍掉
     #+BEGIN_SRC python :results output
       s = 'abcde'
       i = -1
       for i in [None]+range(-1, -len(s), -1):
         print s[:i]
     #+END_SRC

     #+RESULTS:
     : abcde
     : abcd
     : abc
     : ab
     : a
	 
  4. 浅拷贝： 只拷贝了对对象的索引，而不是重新建立了一个对象。P162

  5. basestring() 抽象工厂函数，作用仅仅是为str和unicode函数提过父类。
     所有不能被实例化，也不能被调用。

  6. 在一个对象上使用dir()来查看它所有的方法和属性
     

  おやすみなさい

