_posts/2013-04-08-Learning-Python.html
---
layout: doc
title: Learning Python
subtitle: 学习Python的小型笔记 
categories: note
tags: python
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 前言</a></li>
<li><a href="#sec-2">2 2013-04-13 土曜日</a></li>
<li><a href="#sec-3">3 2013-04-14 日曜日</a></li>
<li><a href="#sec-4">4 2013-04-15 月曜日</a></li>
<li><a href="#sec-5">5 2013-04-16 火曜日</a></li>
<li><a href="#sec-6">6 2013-04-18 木曜日</a></li>
<li><a href="#sec-7">7 2013-04-19 金曜日</a>
<ul>
<li>
<ul>
<li><a href="#sec-7-1">7.1 可变长度的参数 P411</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-8">8 2013-04-20 土曜日</a>
<ul>
<li>
<ul>
<li><a href="#sec-8-1">8.1 内建函数apply(), fliter(), map(), reduce()</a></li>
<li><a href="#sec-8-2">8.2 偏函数(Partial Application)和柯里化Currying</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-9">9 2013-04-21 日曜日</a>
<ul>
<li>
<ul>
<li><a href="#sec-9-1">9.1 作用域和lambda</a></li>
<li><a href="#sec-9-2">9.2 生成器</a></li>
<li><a href="#sec-9-3">9.3 模块：模块是组织python代码的方法，包是组织模块的。</a></li>
<li><a href="#sec-9-4">9.4 名称空间与变量作用域比较 12.3.1</a></li>
<li><a href="#sec-9-5">9.5 面向对象</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-10">10 2013-04-22 月曜日</a></li>
<li><a href="#sec-11">11 2013-04-23 火曜日</a>
<ul>
<li><a href="#sec-11-1">11.1 11.3.6 *函数（与方法）装饰器</a></li>
<li><a href="#sec-11-2">11.2 Random - Generate pseudo-random numbers</a></li>
<li><a href="#sec-11-3">11.3 <code>__builtins__</code> and <code>__builtin__</code></a></li>
</ul>
</li>
<li><a href="#sec-12">12 2013-04-24 水曜日</a></li>
<li><a href="#sec-13">13 2013-05-13 月曜日</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">前言</h2>
<div class="outline-text-2" id="text-1">

<p>这个仅仅是一个开始。是的，这个仅仅是一个开始。
</p>
<p>
为何学习python？因为
</p><blockquote>

<p>life is short - you need Python!
</p>
</blockquote>


<p>
<b>From</b> <a href="http://love-python.blogspot.com/">http://love-python.blogspot.com/</a>
</p>
<p>
还有就是下面一个项目需要使用python<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>和tornado<sup><a class="footref" name="fnr-.2" href="#fn-.2">2</a></sup>来开发项目，一个上位机吧。
我们小组主要负责数据展示这个部分。硬件部分，也就是实际数据采集那个部分由企业来负责。
</p>
<p>
等待学习记录中&hellip;
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2013-04-13 土曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-13 Sat</span></span></h2>
<div class="outline-text-2" id="text-2">

<ol>
<li>Tips:
     <b>How to run Python in Emacs org-mode? Below is the answer</b>
     Just input below into .emacs:



<pre class="example">(org-babel-do-load-languages
  'org-babel-load-languages '((python . t) (R . t)))
</pre>

<p>
     From:
     <a href="http://www.johndcook.com/blog/2012/02/09/python-org-mode/">Running Python and R inside Emacs</a>
</p>
</li>
<li>python的一个切片操作：将字符串倒序输出



<pre class="example">s = 'abcdefgh'
a = s[::-1]
print a  #a : hgfedcba
</pre>


</li>
<li>每次把最后的一个字符砍掉



<pre class="example">s = 'abcde'
i = -1
for i in [None]+range(-1, -len(s), -1):
  print s[:i]
</pre>


</li>
<li>浅拷贝： 只拷贝了对对象的索引，而不是重新建立了一个对象。P162

</li>
<li>basestring() 抽象工厂函数，作用仅仅是为str和unicode函数提过父类。
     所有不能被实例化，也不能被调用。

</li>
<li>在一个对象上使用dir()来查看它所有的方法和属性
</li>
</ol>



<p>
  おやすみなさい
</p>
</div>

</div>
