_articles/2013-04-08-Learning-Python.org
* 2013-04-16 火曜日<2013-04-16 Tue>
  1. 使用映射对象（比如字典）搜索比类似的if-elif-else或者for块.

	 *Attention:*
	 =else= 也可以使用在 =while= and =for= 这些循环中。具体操作如下：
	 只要不是被 =break= 打断的循环，意思就是正常结束的都会去执行跟在下面的 =else= ，
	 另外的说法就是： =break= 会跳过 =else= 代码区.
  2. 疑问：msgs.get(user.cmd, default) P290
	 #+BEGIN_EXAMPLE
	 解答：	 
	 dict.get(key, default=None)
	 #+END_EXAMPLE
	 *From:* http://www.tutorialspoint.com/python/dictionary_get.htm
  3. 一个hack的做法：
	 #+BEGIN_SRC python
	   smaller = (x < y and [x] or [y])[0]
	 #+END_SRC
  4. 与序列相关的内建函数
	 #+BEGIN_SRC python
       sorted()
       reversed()
       enumerate()
       for i, album in enumerate(albums):
           pirnt i, album
       zip()
	 #+END_SRC
  5. break 语句：

	 结束当前循环，然后跳转到下一个语句
  6. itet()创建它的迭代器
	 #+BEGIN_SRC python
       iter(obj)
       iter(func, sentinel)            # 反复调用func，直到迭代器的下一个值为sentinel
	 #+END_SRC
  7. [expr for iter_var in iterable if cond_expr]
  8. 我敬爱的矩阵：
	 #+BEGIN_SRC python :results output
       list = [(x+1, y+1) for x in range(3) for y in range(5)]
       print list
	 #+END_SRC

     #+RESULTS:
	 : [(1, 1), (1, 2), (1, 3), (1, 4), (1, 5), (2, 1), (2, 2), (2, 3), (2, 4), (2, 5), (3, 1), (3, 2), (3, 3), (3, 4), (3, 5)]
  9. 计算一个段落中有多少个空格：
	 #+BEGIN_SRC python :results output
       f = open('hhga.txt', 'r')
       len([word for line in f for word in line.split()])
	 #+END_SRC
  10. 列表解析：[expr for iter\_var in iterable if cond\_expr]	
	  PEP 202 
	  From: http://www.python.org/dev/peps/pep-0202/
  
	  生成器表达式：(expr for iter\_var in iterable if cond\_expr)
	  PEP 289
	  From: http://www.python.org/dev/peps/pep-0289/

	  惰性求值：lazy evaluation
  11. 交叉配对的例子：
	  #+BEGIN_SRC python :results output
        rows = [1, 2, 3, 17]
        def cols():
            yield 56
            yield 2
            yield 1
        x_product_pairs = ((i, j) for i in rows for j in cols())
        for pair in x_product_pairs:
            print pair
	  #+END_SRC

      RESULTS:
      #+begin_example
	  (1, 56)
	  (1, 2)
	  (1, 1)
	  (2, 56)
	  (2, 2)
	  (2, 1)
	  (3, 56)
	  (3, 2)
	  (3, 1)
	  (17, 56)
	  (17, 2)
	  (17, 1)
	  #+end_example

* 2013-04-18 木曜日<2013-04-18 Thu>
  SCHEDULED: <2013-04-21 Sun>
  1. try-except-else-finally P367
  2. with语句
	 
	 with context\_expr [as var]:
	     with\_suite
  3. 先搁置with中 上下文管理协议 P369
	 
  4. raise

	 raise [SomeException [, args, [, traceback]]]
  5. assert expression[, arguments]
	 
	 AsserionError
  6. 标准异常 P375

* 2013-04-19 金曜日<2013-04-19 Fri>
*** 可变长度的参数 P411
	   
	  1. 11.2.4 使用元组（非关键字参数）和字典（关键字参数）
	   	 *port=8080这叫关键字参数*
	   
	   	 func(*tuple-grp-nonkw-args, **dict-grp-kw-args)

	  2. 带元组的函数普通语法：
		 #+BEGIN_SRC python
           def function_name([formal_args,] *vargs_tuple):
               "function_documentation_string"
               function_body_suite
		 #+END_SRC

		 实例：
		 #+BEGIN_SRC python :results output
           def tupleVarArgs(arg1, arg2='defaultB', *theRest):
               print 'formal arg 1:', arg1 
               print 'formal arg 2:', arg2
               for eachXtrArg in theRest:
                   print 'another arg:', eachXtrArg
           
           tupleVarArgs('abc', 123, 'xyz', 456.789)
		 #+END_SRC

         RESULTS:
         : formal arg 1: abc
         : formal arg 2: 123
         : another arg: xyz
         : another arg: 456.789

	  3. 字典函数普通用法：
		 #+BEGIN_SRC python
           def function_name([formal_args,][*vargst,] **vargsd):
               function_documentation_string
               function_body_suite
                   
		 #+END_SRC

		 实例：
		 #+BEGIN_SRC python :results output
           def dictVarArgs(arg1, arg2='defaultB', **theRest):
               print 'formal arg1:', arg1
               print 'formal arg2:', arg2
               for eachXtrArg in theRest.keys():
                   print 'Xtra arg %s: %s' % \
                   (eachXtrArg, str(theRest[eachXtrArg]))
           
           dictVarArgs('one', d=10, e='zoo', men=('freud', 'gaudi'))
		 #+END_SRC

         RESULTS:
         : formal arg1: one
         : formal arg2: defaultB
         : Xtra arg men: ('freud', 'gaudi')
         : Xtra arg e: zoo
         : Xtra arg d: 10

	  4. lambda表达式:
		 
		 #+BEGIN_SRC python
           lambda [arg1[, arg2, ... argN]]: expression
		 #+END_SRC

* 2013-04-20 土曜日<2013-04-20 Sat>
*** 内建函数apply(), fliter(), map(), reduce()
   	玩一下：
     #+BEGIN_SRC python :results output
       print 'the total is:', reduce((lambda x,y: x+y), range(5))
     #+END_SRC

     #+RESULTS:
	 : the total is: 10

*** 偏函数(Partial Application)和柯里化Currying
   	functional模块中的partial()函数创建PFA:
   	#+BEGIN_SRC python :results output
      from functools import partial
      basetwo = partial(int, base=2)
      basetwo.__doc__ = 'Convert base 2'
      print basetwo('10010')
      
   	#+END_SRC

   	RESULTS:
   	: 18

   	#+BEGIN_SRC python :results output
      from operator import add, mul
      from functools import partial
      
      add1 = partial(add, 1)
      mul100 = partial(mul, 100)
      
      print add1(10)
      print mul100(1)
      
   	#+END_SRC

   	RESULTS:
   	: 11
   	: 100


   	*Reference:*

   	1. [[http://alecbenzer.com/blog/currying-partial-application/][Currying vs. Partial Application]]
   	2. [[http://www.aqee.net/currying-partial-application/][函数加里化(Currying)和偏函数应用(Partial Application)的比较]]
   	3. http://book.51cto.com/art/200806/77578.htm
   	4. http://book.51cto.com/art/200806/77579.htm
   	
* 2013-04-21 日曜日<2013-04-21 Sun>
*** 作用域和lambda
   	#+BEGIN_SRC python :results output
      x = 10
      def foo():
          y = 5
          bar = lambda : x + y
          print bar()
      foo()
   	#+END_SRC

   	RESULTS:
   	: 15

*** 生成器
   	协同程序的概念：可以运行的独立函数调用，可以暂停或者挂起，并从程序离开的地方继续或者重新开始。

	资料参考:
	
	  1. PEP 255: http://www.python.org/dev/peps/pep-0255/
	
	  2. Python yield 使用浅析: http://www.ibm.com/developerworks/cn/opensource/os-cn-python-yield/

	  3. 第9章 Lua协同程序http://blog.csdn.net/andylin02/article/details/2185367

   	#+BEGIN_SRC python :results output
      def simpleGen():
          yield 1
          yield '2 --> punch!'
      myG = simpleGen()
      myG.next()
   	#+END_SRC

   	#+RESULTS:

	另外一个例子，求解fib：
	#+BEGIN_SRC python :results output
      def fib():
          a, b = 0, 1
          while 1:
              yield b
              a, b = b, a + b
      
      # Test
      f = fib()
      for i in xrange(5):
          print f.next()
	#+END_SRC

    RESULTS:
	: 1
	: 1
	: 2
	: 3
	: 5

	如果函数有return的话，会立即终止迭代。貌似yield的出现简化程序，但是可以达到
	节省内存的作用，如同下面的一句话。

   	8.13生成器

   	使用生成器的地方：迭代穿越一个巨大的数据集合。到时就知道怎么用了。呵呵。


*** 模块：模块是组织python代码的方法，包是组织模块的。

