_posts/2013-04-08-Learning-Python.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">2013-04-16 火曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-16 Tue</span></span></h2>
<div class="outline-text-2" id="text-5">

<ol>
<li>使用映射对象（比如字典）搜索比类似的if-elif-else或者for块.

<p>
   <b>Attention:</b>
   <code>else</code> 也可以使用在 <code>while</code> and <code>for</code> 这些循环中。具体操作如下：
   只要不是被 <code>break</code> 打断的循环，意思就是正常结束的都会去执行跟在下面的 <code>else</code> ，
   另外的说法就是： <code>break</code> 会跳过 <code>else</code> 代码区.
</p></li>
<li>疑问：msgs.get(user.cmd, default) P290



<pre class="example">解答：  
dict.get(key, default=None)
</pre>

<p>
   <b>From:</b> <a href="http://www.tutorialspoint.com/python/dictionary_get.htm">http://www.tutorialspoint.com/python/dictionary_get.htm</a>
</p></li>
<li>一个hack的做法：



<pre class="example">smaller = (x &lt; y and [x] or [y])[0]
</pre>

</li>
<li>与序列相关的内建函数



<pre class="example">sorted()
reversed()
enumerate()
for i, album in enumerate(albums):
    pirnt i, album
zip()
</pre>

</li>
<li>break 语句：

<p>
   结束当前循环，然后跳转到下一个语句
</p></li>
<li>itet()创建它的迭代器



<pre class="example">iter(obj)
iter(func, sentinel)            # 反复调用func，直到迭代器的下一个值为sentinel
</pre>

</li>
<li>[expr for iter<sub>var</sub> in iterable if cond<sub>expr]</sub>
</li>
<li>我敬爱的矩阵：



<pre class="example">list = [(x+1, y+1) for x in range(3) for y in range(5)]
print list
</pre>

</li>
<li>计算一个段落中有多少个空格：



<pre class="example">f = open('hhga.txt', 'r')
len([word for line in f for word in line.split()])
</pre>

</li>
<li>列表解析：[expr for iter_var in iterable if cond_expr]  
    PEP 202 
    From: <a href="http://www.python.org/dev/peps/pep-0202/">http://www.python.org/dev/peps/pep-0202/</a>

<p>  
    生成器表达式：(expr for iter_var in iterable if cond_expr)
    PEP 289
    From: <a href="http://www.python.org/dev/peps/pep-0289/">http://www.python.org/dev/peps/pep-0289/</a>
</p>
<p>
    惰性求值：lazy evaluation
</p></li>
<li>交叉配对的例子：



<pre class="example">rows = [1, 2, 3, 17]
def cols():
    yield 56
    yield 2
    yield 1
x_product_pairs = ((i, j) for i in rows for j in cols())
for pair in x_product_pairs:
    print pair
</pre>


<p>
      RESULTS:
</p>


<pre class="example">(1, 56)
(1, 2)
(1, 1)
(2, 56)
(2, 2)
(2, 1)
(3, 56)
(3, 2)
(3, 1)
(17, 56)
(17, 2)
(17, 1)
</pre>

</li>
</ol>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">2013-04-18 木曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-18 Thu</span></span></h2>
<div class="outline-text-2" id="text-6">

<p>   <span class="timestamp-wrapper"><span class="timestamp-kwd">SCHEDULED: </span> <span class="timestamp">2013-04-21 Sun</span></span><br/>
</p><ol>
<li>try-except-else-finally P367
</li>
<li>with语句

<p>   
   with context_expr [as var]:
       with_suite
</p></li>
<li>先搁置with中 上下文管理协议 P369

</li>
<li>raise

<p>
   raise [SomeException [, args, [, traceback]]]
</p></li>
<li>assert expression[, arguments]

<p>   
   AsserionError
</p></li>
<li>标准异常 P375
</li>
</ol>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">2013-04-19 金曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-19 Fri</span></span></h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-4">
<h4 id="sec-7-1">可变长度的参数 P411</h4>
<div class="outline-text-4" id="text-7-1">


<ol>
<li>11.2.4 使用元组（非关键字参数）和字典（关键字参数）
       <b>port=8080这叫关键字参数</b>

<p>     
       func(*tuple-grp-nonkw-args, **dict-grp-kw-args)
</p>
</li>
<li>带元组的函数普通语法：



<pre class="example">def function_name([formal_args,] *vargs_tuple):
    "function_documentation_string"
    function_body_suite
</pre>


<p>
     实例：
</p>


<pre class="example">def tupleVarArgs(arg1, arg2='defaultB', *theRest):
    print 'formal arg 1:', arg1 
    print 'formal arg 2:', arg2
    for eachXtrArg in theRest:
        print 'another arg:', eachXtrArg

tupleVarArgs('abc', 123, 'xyz', 456.789)
</pre>


<p>
         RESULTS:
</p><pre class="example">
formal arg 1: abc
formal arg 2: 123
another arg: xyz
another arg: 456.789
</pre>


</li>
<li>字典函数普通用法：



<pre class="example">def function_name([formal_args,][*vargst,] **vargsd):
    function_documentation_string
    function_body_suite

</pre>


<p>
     实例：
</p>


<pre class="example">def dictVarArgs(arg1, arg2='defaultB', **theRest):
    print 'formal arg1:', arg1
    print 'formal arg2:', arg2
    for eachXtrArg in theRest.keys():
        print 'Xtra arg %s: %s' % \
        (eachXtrArg, str(theRest[eachXtrArg]))

dictVarArgs('one', d=10, e='zoo', men=('freud', 'gaudi'))
</pre>


<p>
         RESULTS:
</p><pre class="example">
formal arg1: one
formal arg2: defaultB
Xtra arg men: ('freud', 'gaudi')
Xtra arg e: zoo
Xtra arg d: 10
</pre>


</li>
<li>lambda表达式:




<pre class="example">lambda [arg1[, arg2, ... argN]]: expression
</pre>

</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">2013-04-20 土曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-20 Sat</span></span></h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-4">
<h4 id="sec-8-1">内建函数apply(), fliter(), map(), reduce()</h4>
<div class="outline-text-4" id="text-8-1">

<p>    玩一下：
</p>


<pre class="example">print 'the total is:', reduce((lambda x,y: x+y), range(5))
</pre>


</div>

</div>

<div id="outline-container-8-2" class="outline-4">
<h4 id="sec-8-2">偏函数(Partial Application)和柯里化Currying</h4>
<div class="outline-text-4" id="text-8-2">

<p>    functional模块中的partial()函数创建PFA:
</p>


<pre class="example">from functools import partial
basetwo = partial(int, base=2)
basetwo.__doc__ = 'Convert base 2'
print basetwo('10010')

</pre>


<p>
    RESULTS:
</p><pre class="example">
18
</pre>





<pre class="example">from operator import add, mul
from functools import partial

add1 = partial(add, 1)
mul100 = partial(mul, 100)

print add1(10)
print mul100(1)

</pre>


<p>
    RESULTS:
</p><pre class="example">
11
100
</pre>



<p>
    <b>Reference:</b>
</p>
<ol>
<li><a href="http://alecbenzer.com/blog/currying-partial-application/">Currying vs. Partial Application</a>
</li>
<li><a href="http://www.aqee.net/currying-partial-application/">函数加里化(Currying)和偏函数应用(Partial Application)的比较</a>
</li>
<li><a href="http://book.51cto.com/art/200806/77578.htm">http://book.51cto.com/art/200806/77578.htm</a>
</li>
<li><a href="http://book.51cto.com/art/200806/77579.htm">http://book.51cto.com/art/200806/77579.htm</a>
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">2013-04-21 日曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-21 Sun</span></span></h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-4">
<h4 id="sec-9-1">作用域和lambda</h4>
<div class="outline-text-4" id="text-9-1">




<pre class="example">x = 10
def foo():
    y = 5
    bar = lambda : x + y
    print bar()
foo()
</pre>


<p>
    RESULTS:
</p><pre class="example">
15
</pre>


</div>

</div>

<div id="outline-container-9-2" class="outline-4">
<h4 id="sec-9-2">生成器</h4>
<div class="outline-text-4" id="text-9-2">

<p>    协同程序的概念：可以运行的独立函数调用，可以暂停或者挂起，并从程序离开的地方继续或者重新开始。
</p>
<p>
  资料参考:
</p>
<ol>
<li>PEP 255: <a href="http://www.python.org/dev/peps/pep-0255/">http://www.python.org/dev/peps/pep-0255/</a>

</li>
<li>Python yield 使用浅析: <a href="http://www.ibm.com/developerworks/cn/opensource/os-cn-python-yield/">http://www.ibm.com/developerworks/cn/opensource/os-cn-python-yield/</a>

</li>
<li>第9章 Lua协同程序<a href="http://blog.csdn.net/andylin02/article/details/2185367">http://blog.csdn.net/andylin02/article/details/2185367</a>
</li>
</ol>





<pre class="example">def simpleGen():
    yield 1
    yield '2 --&gt; punch!'
myG = simpleGen()
myG.next()
</pre>


<p>
  另外一个例子，求解fib：
</p>


<pre class="example">def fib():
    a, b = 0, 1
    while 1:
        yield b
        a, b = b, a + b

# Test
f = fib()
for i in xrange(5):
    print f.next()
</pre>


<p>
    RESULTS:
</p><pre class="example">
1
1
2
3
5
</pre>


<p>
  如果函数有return的话，会立即终止迭代。貌似yield的出现简化程序，但是可以达到
  节省内存的作用，如同下面的一句话。
</p>
<p>
    8.13生成器
</p>
<p>
    使用生成器的地方：迭代穿越一个巨大的数据集合。到时就知道怎么用了。呵呵。
</p>

</div>

</div>

<div id="outline-container-9-3" class="outline-4">
<h4 id="sec-9-3">模块：模块是组织python代码的方法，包是组织模块的。</h4>
<div class="outline-text-4" id="text-9-3">


</div>

</div>
