_articles/2013-04-08-Learning-Python.org
*** 名称空间与变量作用域比较 12.3.1
	
	1. 名称空间是纯粹意义上的名字和对象间的映射关系，
	   作用域还指出从用户代码的哪些物理位置可以访问到这些名字。
	
	2. =from module import *= 的使用要限制

	3. =about =__future__=:
	   PEP 236

	4. 绝对导入：

	   相对导入：

	5. 如果你不想导入某个模块，你可以属性名称前加 =_=
	   例如：
	   #+BEGIN_SRC python
         import foo._bar
	   #+END_SRC

	6. 一个UTF-8编码文件可以这样指示：
	   #+BEGIN_SRC python
         #!/usr/bin/env python
         #-*- coding: UTF-8 -*-
	   #+END_SRC

	7. 循环导入：
	   
	   解决方法：
	   
	   1. 将import语句移动到cli4vof

	   2. 将import语句移动到最后

	8. 13.4.2方法 下面这段代码究竟是什么意思呢？ P486
	   #+BEGIN_SRC python :results output
         class MyClass(object):
             def myNoActionMethod(self):
                 pass
         
         mc = MyClass()
         mc.myNoActionMethod();
	   #+END_SRC

    #+RESULTS:

*** 面向对象
	1. =__init__()= 应当返回None
	2. 特殊的实例属性
	   #+BEGIN_EXAMPLE
	   I.__class__   实例化I的类
	   
	   I.__dict__    I的属性
	   #+END_EXAMPLE
	3. 实现 =__setattr__()= 本身就是一个冒险的经历，满是圈套和陷阱，例如：
	   无穷递归和破坏实例对象。
	4. classmethod
	   #+BEGIN_SRC python :results output
         class TestClassMethod:
             @classmethod
             def foo(cls):
                 print 'calling class method foo()'
                 print 'foo() is part of class: ', cls.__name__
         
         TestClassMethod.foo()
	   #+END_SRC

       #+RESULTS:
	   : calling class method foo()
	   : foo() is part of class:  TestClassMethod
	   
* 2013-04-22 月曜日<2013-04-22 Mon>
  1. 疑问：
	 P545中， =__XXX(parent)= and =__XXX(child)=
  2. 难道是Python2.2之前，从Python标准类型子类化或派生类都是不允许的。
	 于是出现了包装？？？？？？？？？？？？？？
  3. =_bulitin_= and =_builtins_=
* 2013-04-23 火曜日<2013-04-23 Tue>
  1. =exec= =eval()= and =compile()=
	 #+BEGIN_SRC python :results output
       # -*-coding: utf-8 -*-
       # 'eval' 可求值的表达式[和eval()一起使用]
       # 'single' 单一可执行语句[和exec 一起使用]
       # 'exec' 可执行语句组[和exec 一起使用]
       eval_code = compile('100+300', '', 'eval')
       print eval(eval_code)
       
       single_code = compile('print "icecream!"', '', 'single')
       print single_code
       exec single_code
	 #+END_SRC

     RESULTS:
	 : 400
	 : <code object <module> at 0000000002553F30, file "", line 1>
	 : icecream!

  2. exec 还可以接受有效的python文件对象。意思就是你将代码写在一个icecream.py的
	 文件中，然后在解释器中写入:
	 #+BEGIN_SRC python
       f = open('icecream.py')
       exec f   
	 #+END_SRC
	 *Attention:*
	 再次执行exec时，文件已经到达EOF。如果想再次执行，需要如下操作：
	 #+BEGIN_SRC python
       f.seek(0)
       exec f
	 #+END_SRC

  3. input() = eval() + raw\_input() = eval(raw\_input())
	 #+BEGIN_SRC python :results output
	   aList = input('Enter a list:') #Enter a list: [123, 'abc']
	   aList                          # [123, 'abc']
	 #+END_SRC


** 11.3.6 *函数（与方法）装饰器
   装饰器在函数调用之上的装饰，装饰器可以如图函数调用一样“堆叠”起来。
   装饰器实际就是函数，他们接受函数对象。本质上：java's AOP(Aspect Oriented Progrmming)

   函数组合数学定义：
   #+BEGIN_EXAMPLE
     (g · f)(x) = g(f(x))
     @g
     @f
     def foo():
         ......
     与foo=g(f(foo))相同   
   #+END_EXAMPLE

   一个小列子：
   #+BEGIN_SRC python
     @deco1(deco_arg)
     @deco2
     def func(): pass
     
     This is equivalent to:这等价于：
     func = deco1(deco_arg)(deco2(func))
        
   #+END_SRC

   一个较大的例子：
   #+BEGIN_SRC python :results output
     #!/usr/bin/env python
     #-*- coding: utf-8 -*-
     
     from time import ctime, sleep
     
     def tsfunc(func):
         def wrappedFunc():
             print '[%s] %s() called' % (ctime(), func.__name__)
             return func;
         return wrappedFunc;
     
     @tsfunc
     def foo():
         pass
     
     foo()
     sleep(2)
     
     for i in range(2):
         sleep(1)
         foo()
     
   #+END_SRC

   RESULTS:
   : [Tue Apr 23 14:37:08 2013] foo() called
   : [Tue Apr 23 14:37:11 2013] foo() called
   : [Tue Apr 23 14:37:12 2013] foo() called

   *Reference*:
   From: http://docs.python.org/2/library/functools.html
   

** Random - Generate pseudo-random numbers
   #+BEGIN_SRC python :results output
     import random
     
     print 'random:', random.random()
     print 'uniform:', random.uniform(1, 10)
     print 'randint:', random.randint(1, 10)
     print 'randrange:', random.randrange(0, 101, 2)
     print 'choice:', random.choice('abcd')
     
     items = [1,2,3,4,5,6]
     random.shuffle(items)
     print 'items:', items
     
     print 'sample:', random.sample([1,2,3,4,5], 3)   # choose 3 elements
   #+END_SRC

   RESULTS:
   : random: 0.624959723641
   : uniform: 4.2231135682
   : randint: 7
   : randrange: 56
   : choice: b
   : items: [2, 4, 6, 1, 5, 3]
   : sample: [5, 2, 3]
   From: http://docs.python.org/2/library/random.html#random.gammavariate
 

** =__builtins__= and =__builtin__=
   P454
   
   =__builtins__= 包含 =__builtin__= 所有的名字

   =__builtins__= 模块和 =__builtin__= 模块不能混淆。 虽然它们的名字相似——尤其对于新手来
   说。 =__builtins__= 模块包含内建名称空间中内建名字的集合。 其中大多数(如果不是全部的话)来
   自 =__builtin__= 模块, 该模块包含内建函数, 异常以及其他属性。 在标准 Python 执行环境下,
   =__builtins__= 包含 =__builtin__= 的所有名字。 Python 曾经有一个限制执行模式, 允许你修改
   =__builtins__= , 只保留来自 =__builtin__= 的一部分, 创建一个沙盒（sandbox）环境。但是, 因为
   它有一定的安全缺陷, 而且修复它很困难, Python 已经不再支持限制执行模式。(如版本2.3 )

* 2013-04-24 水曜日<2013-04-24 Wed>
  1.正则表达式：
    #+BEGIN_SRC python :results output
      #-*-coding: utf-8 -*-
      
      import re
      data = 'Thu Feb 15 17:46:04 2007::creamidea@icecream.com::1171590364-8-8'
      
      patt = '^(Mon|Tue|Wed|Thu|Fri|Sat|Sun)'
      m = re.match(patt, data)
      print 'm.group():', m.group()
      print 'm.group(1):', m.group(1)
      print 'm.groups():', m.groups()
      
      print '-'*20
      patt = '^((\w){3})'
      m = re.match(patt, data)
      print 'm.group():', m.group()
      print 'm.group(1):', m.group(1)
      print 'm.groups():', m.groups()
      
      print '-'*20
      patt = '^(\w){3}'
      m = re.match(patt, data)
      print 'm.group():', m.group()
      print 'm.group(1):', m.group(1)
      print 'm.groups():', m.groups()
      
      print '-'*20
      patt = '\d+-\d+-\d+'
      m = re.search(patt, data)
      print 'm.group():', m.group()
      
      print '-'*20
      patt = '.+?(\d+-\d+-\d+)'       # ？ 取消系统的贪婪匹配
      m = re.match(patt, data)        # 使用匹配函数
      print 'm.group():', m.group()
      print 'm.group(1):', m.group(1)
      
    #+END_SRC

    #+RESULTS:
    #+begin_example
    m.group(): Thu
    m.group(1): Thu
    m.groups(): ('Thu',)
    --------------------
    m.group(): Thu
    m.group(1): Thu
    m.groups(): ('Thu', 'u')
    --------------------
    m.group(): Thu
    m.group(1): u
    m.groups(): ('u',)
    --------------------
    m.group(): 1171590364-8-8
    --------------------
    m.group(): Thu Feb 15 17:46:04 2007::creamidea@icecream.com::1171590364-8-8
    m.group(1): 1171590364-8-8
    #+end_example

* 2013-05-13 月曜日<2013-05-13 Mon>
  1. 解决 =error: Unable to find vcvarsall.bat= 问题：

	 If you have Visual Studio 2010 installed, execute

	 =SET VS90COMNTOOLS=%VS100COMNTOOLS%=
	 
	 or with Visual Studio 2012 installed
	 
	 =SET VS90COMNTOOLS=%VS110COMNTOOLS%=
	 
	 *Reference:*
	 + http://stackoverflow.com/questions/2817869/error-unable-to-find-vcvarsall-bat
	 + http://wangye.org/blog/archives/738/


