_posts/2013-04-08-Learning-Python.html

<div id="outline-container-9-4" class="outline-4">
<h4 id="sec-9-4">名称空间与变量作用域比较 12.3.1</h4>
<div class="outline-text-4" id="text-9-4">


<ol>
<li>名称空间是纯粹意义上的名字和对象间的映射关系，
     作用域还指出从用户代码的哪些物理位置可以访问到这些名字。

</li>
<li><code>from module import *</code> 的使用要限制

</li>
<li><code>about =__future__</code>:
     PEP 236

</li>
<li>绝对导入：

<p>
     相对导入：
</p>
</li>
<li>如果你不想导入某个模块，你可以属性名称前加 <code>_</code>
     例如：



<pre class="example">import foo._bar
</pre>


</li>
<li>一个UTF-8编码文件可以这样指示：



<pre class="example">#!/usr/bin/env python
#-*- coding: UTF-8 -*-
</pre>


</li>
<li>循环导入：

<p>     
     解决方法：
</p>
<ol>
<li>将import语句移动到cli4vof

</li>
<li>将import语句移动到最后

</li>
</ol>

</li>
<li>13.4.2方法 下面这段代码究竟是什么意思呢？ P486



<pre class="example">class MyClass(object):
    def myNoActionMethod(self):
        pass

mc = MyClass()
mc.myNoActionMethod();
</pre>

</li>
</ol>


</div>

</div>

<div id="outline-container-9-5" class="outline-4">
<h4 id="sec-9-5">面向对象</h4>
<div class="outline-text-4" id="text-9-5">

<ol>
<li><code>__init__()</code> 应当返回None
</li>
<li>特殊的实例属性



<pre class="example">I.__class__   实例化I的类

I.__dict__    I的属性
</pre>

</li>
<li>实现 <code>__setattr__()</code> 本身就是一个冒险的经历，满是圈套和陷阱，例如：
     无穷递归和破坏实例对象。
</li>
<li>classmethod



<pre class="example">class TestClassMethod:
    @classmethod
    def foo(cls):
        print 'calling class method foo()'
        print 'foo() is part of class: ', cls.__name__

TestClassMethod.foo()
</pre>

</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">2013-04-22 月曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-22 Mon</span></span></h2>
<div class="outline-text-2" id="text-10">

<ol>
<li>疑问：
   P545中， <code>__XXX(parent)</code> and <code>__XXX(child)</code>
</li>
<li>难道是Python2.2之前，从Python标准类型子类化或派生类都是不允许的。
   于是出现了包装？？？？？？？？？？？？？？
</li>
<li><code>_bulitin_</code> and <code>_builtins_</code>
</li>
</ol>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">2013-04-23 火曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-23 Tue</span></span></h2>
<div class="outline-text-2" id="text-11">

<ol>
<li><code>exec</code> <code>eval()</code> and <code>compile()</code>



<pre class="example"># -*-coding: utf-8 -*-
# 'eval' 可求值的表达式[和eval()一起使用]
# 'single' 单一可执行语句[和exec 一起使用]
# 'exec' 可执行语句组[和exec 一起使用]
eval_code = compile('100+300', '', 'eval')
print eval(eval_code)

single_code = compile('print "icecream!"', '', 'single')
print single_code
exec single_code
</pre>


<p>
     RESULTS:
</p><pre class="example">
400
&lt;code object &lt;module&gt; at 0000000002553F30, file "", line 1&gt;
icecream!
</pre>


</li>
<li>exec 还可以接受有效的python文件对象。意思就是你将代码写在一个icecream.py的
   文件中，然后在解释器中写入:



<pre class="example">f = open('icecream.py')
exec f   
</pre>

<p>
   <b>Attention:</b>
   再次执行exec时，文件已经到达EOF。如果想再次执行，需要如下操作：
</p>


<pre class="example">f.seek(0)
exec f
</pre>


</li>
<li>input() = eval() + raw_input() = eval(raw_input())



<pre class="example">aList = input('Enter a list:') #Enter a list: [123, 'abc']
aList                          # [123, 'abc']
</pre>

</li>
</ol>




</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1">11.3.6 *函数（与方法）装饰器</h3>
<div class="outline-text-3" id="text-11-1">

<p>   装饰器在函数调用之上的装饰，装饰器可以如图函数调用一样“堆叠”起来。
   装饰器实际就是函数，他们接受函数对象。本质上：java's AOP(Aspect Oriented Progrmming)
</p>
<p>
   函数组合数学定义：
</p>


<pre class="example">(g · f)(x) = g(f(x))
@g
@f
def foo():
    ......
与foo=g(f(foo))相同   
</pre>


<p>
   一个小列子：
</p>


<pre class="example">@deco1(deco_arg)
@deco2
def func(): pass

This is equivalent to:这等价于：
func = deco1(deco_arg)(deco2(func))

</pre>


<p>
   一个较大的例子：
</p>


<pre class="example">#!/usr/bin/env python
#-*- coding: utf-8 -*-

from time import ctime, sleep

def tsfunc(func):
    def wrappedFunc():
        print '[%s] %s() called' % (ctime(), func.__name__)
        return func;
    return wrappedFunc;

@tsfunc
def foo():
    pass

foo()
sleep(2)

for i in range(2):
    sleep(1)
    foo()

</pre>


<p>
   RESULTS:
</p><pre class="example">
[Tue Apr 23 14:37:08 2013] foo() called
[Tue Apr 23 14:37:11 2013] foo() called
[Tue Apr 23 14:37:12 2013] foo() called
</pre>


<p>
   <b>Reference</b>:
   From: <a href="http://docs.python.org/2/library/functools.html">http://docs.python.org/2/library/functools.html</a>
</p>

</div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2">Random - Generate pseudo-random numbers</h3>
<div class="outline-text-3" id="text-11-2">




<pre class="example">import random

print 'random:', random.random()
print 'uniform:', random.uniform(1, 10)
print 'randint:', random.randint(1, 10)
print 'randrange:', random.randrange(0, 101, 2)
print 'choice:', random.choice('abcd')

items = [1,2,3,4,5,6]
random.shuffle(items)
print 'items:', items

print 'sample:', random.sample([1,2,3,4,5], 3)   # choose 3 elements
</pre>


<p>
   RESULTS:
</p><pre class="example">
random: 0.624959723641
uniform: 4.2231135682
randint: 7
randrange: 56
choice: b
items: [2, 4, 6, 1, 5, 3]
sample: [5, 2, 3]
</pre>

<p>   From: <a href="http://docs.python.org/2/library/random.html#random.gammavariate">http://docs.python.org/2/library/random.html#random.gammavariate</a>
</p>

</div>

</div>

<div id="outline-container-11-3" class="outline-3">
<h3 id="sec-11-3"><code>__builtins__</code> and <code>__builtin__</code></h3>
<div class="outline-text-3" id="text-11-3">

<p>   P454
</p>
<p>   
   <code>__builtins__</code> 包含 <code>__builtin__</code> 所有的名字
</p>
<p>
   <code>__builtins__</code> 模块和 <code>__builtin__</code> 模块不能混淆。 虽然它们的名字相似——尤其对于新手来
   说。 <code>__builtins__</code> 模块包含内建名称空间中内建名字的集合。 其中大多数(如果不是全部的话)来
   自 <code>__builtin__</code> 模块, 该模块包含内建函数, 异常以及其他属性。 在标准 Python 执行环境下,
   <code>__builtins__</code> 包含 <code>__builtin__</code> 的所有名字。 Python 曾经有一个限制执行模式, 允许你修改
   <code>__builtins__</code> , 只保留来自 <code>__builtin__</code> 的一部分, 创建一个沙盒（sandbox）环境。但是, 因为
   它有一定的安全缺陷, 而且修复它很困难, Python 已经不再支持限制执行模式。(如版本2.3 )
</p>
</div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">2013-04-24 水曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-04-24 Wed</span></span></h2>
<div class="outline-text-2" id="text-12">

<p>  1.正则表达式：
</p>


<pre class="example">#-*-coding: utf-8 -*-

import re
data = 'Thu Feb 15 17:46:04 2007::creamidea@icecream.com::1171590364-8-8'

patt = '^(Mon|Tue|Wed|Thu|Fri|Sat|Sun)'
m = re.match(patt, data)
print 'm.group():', m.group()
print 'm.group(1):', m.group(1)
print 'm.groups():', m.groups()

print '-'*20
patt = '^((\w){3})'
m = re.match(patt, data)
print 'm.group():', m.group()
print 'm.group(1):', m.group(1)
print 'm.groups():', m.groups()

print '-'*20
patt = '^(\w){3}'
m = re.match(patt, data)
print 'm.group():', m.group()
print 'm.group(1):', m.group(1)
print 'm.groups():', m.groups()

print '-'*20
patt = '\d+-\d+-\d+'
m = re.search(patt, data)
print 'm.group():', m.group()

print '-'*20
patt = '.+?(\d+-\d+-\d+)'       # ？ 取消系统的贪婪匹配
m = re.match(patt, data)        # 使用匹配函数
print 'm.group():', m.group()
print 'm.group(1):', m.group(1)

</pre>


</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">2013-05-13 月曜日 <span class="timestamp-wrapper"> <span class="timestamp">2013-05-13 Mon</span></span></h2>
<div class="outline-text-2" id="text-13">

<ol>
<li>解决 <code>error: Unable to find vcvarsall.bat</code> 问题：

<p>
   If you have Visual Studio 2010 installed, execute
</p>
<p>
   <code>SET VS90COMNTOOLS=%VS100COMNTOOLS%</code>
</p>
<p>   
   or with Visual Studio 2012 installed
</p>
<p>   
   <code>SET VS90COMNTOOLS=%VS110COMNTOOLS%</code>
</p>
<p>   
   <b>Reference:</b>
</p><ul>
<li><a href="http://stackoverflow.com/questions/2817869/error-unable-to-find-vcvarsall-bat">http://stackoverflow.com/questions/2817869/error-unable-to-find-vcvarsall-bat</a>
</li>
<li><a href="http://wangye.org/blog/archives/738/">http://wangye.org/blog/archives/738/</a>
</li>
</ul>

</li>
</ol>
