_articles/2013-04-08-Learning-Python.org
* Footnotes

[fn:1] http://www.python.org/

[fn:2] http://www.tornadoweb.org/en/stable/
  
[fn:3] http://www.python.org/dev/peps/pep-0008/

[fn:4] Imports: Multi-Line and Absolute/Relative: http://www.python.org/dev/peps/pep-0328/

[fn:5] http://docs.python.org/2/tutorial/modules.html#packages
