_posts/2013-04-08-Learning-Python.html


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> <a href="http://www.python.org/">http://www.python.org/</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.2" href="#fnr-.2">2</a></sup> <a href="http://www.tornadoweb.org/en/stable/">http://www.tornadoweb.org/en/stable/</a>
</p>



</div>
</div>

</div>
</div>
